
## Plan Result (prod)




<pre><code>Plan: 2 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_private_endpoint.ped_web_pubsub_private_endpoint
  * azurerm_web_pubsub_network_acl.ped_web_pubsub_network_acl


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_private_endpoint.ped_web_pubsub_private_endpoint will be created
  + resource "azurerm_private_endpoint" "ped_web_pubsub_private_endpoint" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "em-icp-prod-privateendpoint"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "cft-prod-network-rg"
      + subnet_id                = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/virtualNetworks/cft-prod-vnet/subnets/private-endpoints"

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "em-icp-prod-service-connection"
          + private_connection_resource_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/em-icp-prod/providers/Microsoft.SignalRService/webPubSub/em-icp-webpubsub-prod"
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "webpubsub",
            ]
        }
    }

  # azurerm_web_pubsub_network_acl.ped_web_pubsub_network_acl will be created
  + resource "azurerm_web_pubsub_network_acl" "ped_web_pubsub_network_acl" {
      + default_action = "Allow"
      + id             = (known after apply)
      + web_pubsub_id  = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/em-icp-prod/providers/Microsoft.SignalRService/webPubSub/em-icp-webpubsub-prod"

      + private_endpoint {
          + allowed_request_types = []
          + denied_request_types  = []
          + id                    = (known after apply)
        }

      + public_network {}
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":1452,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->